#+begin_header
#+TITLE: Supporting Information: Adsorption energy correlations at the metal-support boundary
#+LATEX_CLASS: achemso
#+LATEX_CLASS_OPTIONS: [journal=accacs,manuscript=article,email=true, layout=traditional]
#+latex_header: \setkeys{acs}{biblabel=brackets,super=true,articletitle=true,maxauthors=3}
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: author:nil date:nil toc:nil
#+latex_header: \usepackage[T1]{fontenc}
#+latex_header: \usepackage{fixltx2e}
#+latex_header: \usepackage{url}
#+latex_header: \usepackage{mhchem}
#+latex_header: \usepackage{graphicx}
#+latex_header: \usepackage{color}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{textcomp}
#+latex_header: \usepackage{wasysym}
#+latex_header: \usepackage{latexsym}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{minted}
#+latex_header: \usepackage{attachfile}
#+latex_header: \usepackage[linktocpage, pdfstartview=FitH, colorlinks, linkcolor=black, anchorcolor=black, citecolor=black, filecolor=blue, menucolor=black, urlcolor=blue]{hyperref}

#+latex_header: \author{Prateek Mehta}
#+latex_header: \affiliation{Department of Chemical and Biomolecular Engineering, University of Notre Dame, Notre Dame, Indiana 46556, United States}

#+latex_header: \author{Jefferey Greeley}
#+latex_header: \affiliation{School of Chemical Engineering, Purdue University, West Lafayette, Indiana 47907, United States}

#+latex_header: \author{W. Nicholas Delgass}
#+latex_header: \affiliation{School of Chemical Engineering, Purdue University, West Lafayette, Indiana 47907, United States}

#+latex_header: \author{William F. Schneider}
#+latex_header: \email{wschneider@nd.edu}
#+latex_header: \affiliation{Department of Chemical and Biomolecular Engineering, University of Notre Dame, Notre Dame, Indiana 46556, United States}
#+latex_header: \keywords{}
#+latex_header:\renewcommand{\thefigure}{S\arabic{figure}}
#+latex_header:\renewcommand{\thetable}{S\arabic{table}}
#+end_header

\newpage

** Calculation types and key-value pairs

Every entry in our database file has descriptive key-value pairs that can be used to query the database to obtain more information about a particular calculation or a selection of calculations. For example, gas-phase calculations for the adsorbates have the keyword ``specie'', which is associated with the chemical formula of the adsorbate. The surface calculations contain the key "surf", whose values describe the type of the surface, e.g. ``MgO'', ``<M>-(211)'', ``<M>-nanowire-on-MgO'', etc. Additional key value pairs are present in each calculation. The code below shows the main types of calculations in the database, and prints the key-value pairs that may be present in each calculation type in the output. The example is shown with Pt as a representative metal, which may be any of Rh, Ir, Pd, Pt, Ag, Au. Illustrative examples of using the key value pairs to query the database and reproducing the figures in the paper are provided in Sec. [[ref:sec:fig-reproduction]].

#+BEGIN_SRC python :results output
from ase.db import connect
import numpy as np
from utils import print_possible_kvp

db = connect('metal-support-boundary.db')

example_selections = ['specie',
                      'surf=MgO',
                      'surf=Pt-111',
                      'surf=Pt-211',
                      'surf=Pt-nanowire',
                      'surf=Pt-nanowire-on-MgO',
                      'surf=Pt-nanowire-oxide-removed',
                      'surf=Pt-nanowire-oxide-and-F-removed']

for selection in example_selections:
    print_possible_kvp(db, selection)
#+END_SRC

#+RESULTS:
#+begin_example
Possible key-value pairs for selection: specie
calc_type: relax
specie: C, CH, F, O, N, CH2, H2N, HN, HO

Possible key-value pairs for selection: surf=MgO
surf: MgO
layers: 6
ads: None, CH, F, C, O, N, CH2, H2N, HN, HO
area: 2x2
site: Mg
calc_type: scf, relax

Possible key-value pairs for selection: surf=Pt-111
surf: Pt-111
calc_type: relax
ads: None, CH, F, C, O, N, CH2, H2N, HN, HO

Possible key-value pairs for selection: surf=Pt-211
surf: Pt-211
calc_type: relax
ads: None, CH, F, C, O, N, CH2, H2N, HN, HO

Possible key-value pairs for selection: surf=Pt-nanowire
surf: Pt-nanowire
calc_type: relax
ads: C, CH, F, None, O, N, CH2, H2N, HN, HO
p_lattice: Pt

Possible key-value pairs for selection: surf=Pt-nanowire-on-MgO
surf: Pt-nanowire-on-MgO
calc_type: scf, relax
ads: None, CH, F, C, O, N, CH2, H2N, HN, HO, H2N*
p_lattice: MgO, Pt
site: R, B1

Possible key-value pairs for selection: surf=Pt-nanowire-oxide-removed
surf: Pt-nanowire-oxide-removed
calc_type: scf, relax_ads
ads: None, F, O, N, CH2, H2N, HN, HO, H2N*
p_lattice: MgO, Pt
site: B1

Possible key-value pairs for selection: surf=Pt-nanowire-oxide-and-F-removed
surf: Pt-nanowire-oxide-and-F-removed
calc_type: scf
ads: F
p_lattice: MgO
site: B1

#+end_example


** Anatomy of a database entry

The code below shows an example of using the ASE interface to make a query for a specific database entry, and accessing the information contained within that query. Gas phase OH has been used as an example for simplicity, but the procedure below is applicable to any database entry. The ASE database stores some general information about the calculation by default. In addition, we have stored more specific calculation details associated with the VASP calculator as a json string using /jasp/. This example illustrates that it is possible to obtain all the parameters that were used to create the VASP input files (INCAR, KPOINTS, POTCAR, and POSCAR) and reproduce the calculations in exactly the way they were done by us.

#+BEGIN_SRC python :results output
from ase.db import connect
import numpy as np
import json

db = connect('metal-support-boundary.db')

# We can get an ASE atoms object like this
atoms = db.get_atoms(specie='HO',
                     calc_type='relax')

# The atoms row object stores information
# about the calculation
atomsrow = db.get(specie='HO',
                  calc_type='relax')

print "Basic calculation information:\n"

for key in atomsrow:
    info = atomsrow[key]
    
    if not key is 'calculator_parameters':
        if isinstance(info, np.ndarray):
            print '{0}:'.format(key)
            print '{0}'.format(info)
        else:
            print '{0}: {1}'.format(key, info)

    else:
        # detailed calculation info
	# is saved as a json string by jasp
        calc_params = json.loads(info)

print "\nDetailed calculator parameters:"

# Now print out calculator_parameters
print '\nINCAR:'
for key, val in calc_params['incar'].iteritems():
    print '{0}={1}'.format(key, val)

print '\nOther Input:'
for key, val in calc_params['input'].iteritems():
    print '{0}={1}'.format(key, val)

print '\nPOTCARs:'
for sym, potcar, githash in calc_params['potcar']:
    print sym, potcar, githash

#+END_SRC

#+RESULTS:
#+begin_example
Basic calculation information:

forces:
[[ 0.        0.002921 -0.002801]
 [ 0.       -0.002921  0.002801]]
tags:
[0 0]
calculator: vasp
numbers:
[8 1]
mtime: 17.0915748765
ctime: 17.0915748765
magmom: 1.0000018
initial_magmoms:
[ 0.5  0.5]
specie: HO
positions:
[[ 5.5         4.57215115  4.25293006]
 [ 5.5         5.42784885  4.74706994]]
id: 27
cell:
[[ 11.   0.   0.]
 [  0.  10.   0.]
 [  0.   0.   9.]]
free_energy: -7.72863766
pbc:
[ True  True  True]
calc_type: relax
energy: -7.72863766
unique_id: 4e0f2d0e4d0b4665c3c4229f02001d87
user: pmehta1

Detailed calculator parameters:

INCAR:
magmom=[0.5, 0.5]
isif=0
doc=INCAR parameters
lvtot=False
encut=400.0
lcharg=False
ibrion=2
nbands=8
ediffg=-0.01
ispin=2
lwave=False
sigma=0.001
nsw=100

Other Input:
pp=PBE
reciprocal=False
xc=None
kpts=[1, 1, 1]
kpts_nintersections=None
setups=None
txt=-
gamma=False

POTCARs:
H potpaw/H/POTCAR 6ffd42a20d00a4c64c8eafc31dd1a6344c7a7ace
O potpaw/O/POTCAR ed92eda81889c737add534c028871fa71f3efb53
#+end_example



*** Fig 5: Distance Relationships

#+BEGIN_SRC python :results output org drawer
import matplotlib.pyplot as plt
import seaborn as sns
from ase.db import connect
import numpy as np
from utils import get_energy, amarkers, mcolors
from ase.visualize import view

db = connect('metal-support-boundary.db')

sns.set_context('poster')
plt.figure(figsize=(9, 12), dpi=300)

# Legend stuff
plots_m, labels_m, plots_a, labels_a = [], [], [], []

for m in ['Rh', 'Ir', 'Pd', 'Pt', 'Ag', 'Au']:
    p1, = plt.plot([], [], 's', color=mcolors[m], label=m, ms=22)
    plots_m.append(p1)
    labels_m.append(m)

for a in ['C', 'N', 'O', 'CH', 'NH', 'OH', 'F']:
    ads = a
    if a in ['NH', 'OH']:
        ads = a[1:] + a[0]
    p2, = plt.plot([], [], amarkers[ads], color='w', mew=1.5, mec='k', ms=20)
    plots_a.append(p2)
    labels_a.append(a)

ax1 = plt.subplot2grid((12, 2), (0, 0), colspan=1, rowspan=5)
ax2 = plt.subplot2grid((12, 2), (0, 1), colspan=1, rowspan=5)
ax3 = plt.subplot2grid((12, 2), (5, 0), colspan=1, rowspan=5)
ax4 = plt.subplot2grid((12, 2), (5, 1), colspan=1, rowspan=5)

for metal, color in mcolors.iteritems():

    E_M_MgO = get_energy(db,
                         surf='{0}-nanowire-on-MgO'.format(metal),
                         ads='None',
                         calc_type='relax',
                         p_lattice='MgO')

    for ads, marker in amarkers.iteritems():
        try:
            M_MgO_A = db.get_atoms(surf='{0}-nanowire-on-MgO'.format(metal),
                                   ads=ads,
                                   calc_type='relax',
                                   site='B1',
                                   p_lattice='MgO')

            E_M_MgO_A = M_MgO_A.get_potential_energy()
            M_MgO_A_pos = M_MgO_A.get_positions()


            # For some reason this position is different
            if (ads is 'CH2' and metal is 'Ir'):
                d_Mg_A = np.linalg.norm(M_MgO_A_pos[132]
                                        - M_MgO_A_pos[29])
            else:
                d_Mg_A = np.linalg.norm(M_MgO_A_pos[132]
                                        - M_MgO_A_pos[57])

	    # Distance from bridge site
	    d_M_A_fix = np.linalg.norm(M_MgO_A_pos[132]
				       - (M_MgO_A_pos[113]
					  + M_MgO_A_pos[110]) / 2.)

            M_MgOrem_Afixed = db.get_atoms(surf='{0}-nanowire-oxide-removed'.format(metal),
                                           ads=ads,
                                           p_lattice='MgO',
                                           calc_type='scf',
                                           site='B1')

            E_M_MgOrem_Afixed = M_MgOrem_Afixed.get_potential_energy()

            E_M_MgOrem = get_energy(db,
                                    surf='{0}-nanowire-oxide-and-{1}-removed'.format(
                                        metal, ads),
                                    ads=ads,
                                    p_lattice='MgO',
                                    calc_type='scf',
                                    site='B1')

            M_MgOrem_Arelaxed = db.get_atoms(surf='{0}-nanowire-oxide-removed'.format(metal),
                                             ads=ads,
                                             p_lattice='MgO',
                                             calc_type='relax_ads',
                                             site='B1')
            M_A_rel_pos = M_MgOrem_Arelaxed.get_positions()
            # Distance from bridge site
            d_M_A_relaxed = np.linalg.norm(M_A_rel_pos[24]
                                           - (M_A_rel_pos[5]
                                              + M_A_rel_pos[2]) / 2.)
            E_M_MgOrem_Arelaxed = M_MgOrem_Arelaxed.get_potential_energy()

            del_E_ads_12 = E_M_MgO_A - E_M_MgO - (E_M_MgOrem_Afixed - E_M_MgOrem)
            del_E_ads_23 = E_M_MgOrem_Afixed - E_M_MgOrem_Arelaxed

            kwargs = dict(color=color,
                          ls='None',
                          marker=marker,
                          ms=20,
                          mec='k',
                          mew=1.5)

            if ads not in ['CH2', 'H2N']:
                ax1.plot(d_Mg_A, d_M_A_fix, **kwargs)
                ax2.plot(d_Mg_A, del_E_ads_12, **kwargs)
                ax3.plot(d_M_A_fix, del_E_ads_12, **kwargs)
                ax4.plot(d_M_A_fix - d_M_A_relaxed, del_E_ads_23, **kwargs)
        except(KeyError):
	    pass


ax1.xaxis.set_ticks(np.arange(1.9, 2.5, 0.2))
ax1.set_xlim(1.85, 2.45)
ax1.set_ylim(1, 2.1)
ax1.set_xlabel('$d_{\mathrm{Mg}}$ ($\AA$)', fontsize=28)
ax1.set_ylabel('$d_{\mathrm{M}}$ ($\AA$)', fontsize=28)
ax1.tick_params(axis='x', labelsize=22)
ax1.tick_params(axis='y', labelsize=22)

ax2.xaxis.set_ticks(np.arange(1.9, 2.5, 0.2))
ax2.set_xlabel('$d_{\mathrm{Mg}}$ ($\AA$)', fontsize=28)
ax2.set_ylabel('$\Delta E^{\mathrm{bond}}_{\mathrm{ads}}$ (eV)', fontsize=28)
ax2.tick_params(axis='x', labelsize=22)
ax2.tick_params(axis='y', labelsize=22)
ax2.set_xlim(1.85, 2.45)

ax3.xaxis.set_ticks(np.arange(1., 2.2, 0.4))
ax3.set_xlabel('$d_{\mathrm{M}}$ ($\AA$)', fontsize=28)
ax3.set_ylabel('$\Delta E^{\mathrm{bond}}_{\mathrm{ads}}$ (eV)', fontsize=28)
ax3.tick_params(axis='x', labelsize=22)
ax3.tick_params(axis='y', labelsize=22)
ax3.set_xlim(1.0, 2.1)

ax4.set_xlabel('$\Delta d_{\mathrm{M}}$ ($\AA$)', fontsize=28)
ax4.set_ylabel('$\Delta E^{\mathrm{reorient}}_{\mathrm{ads}}$ (eV)', fontsize=28)
ax4.tick_params(axis='x', labelsize=22)
ax4.tick_params(axis='y', labelsize=22)
ax4.xaxis.set_ticks(np.arange(0.0, 0.6, 0.2))
ax4.yaxis.set_ticks(np.arange(0.0, 0.9, 0.2))
ax4.set_xlim(-0.05, 0.5)

# Now make the legend
lm = plt.legend(plots_m,
                labels_m,
                bbox_to_anchor=(0.8, -0.25),
                ncol=6,
                frameon=True,
                fontsize=24,
                labelspacing=0.25,
                columnspacing=0.25,
                handletextpad=0,
                markerscale=0.8,
                borderpad=0.25,
                fancybox=True)
la = plt.legend(plots_a,
                labels_a,
                frameon=True,
                bbox_to_anchor=(0.95, -0.4),
                ncol=7,
                fontsize=24,
                labelspacing=0.25,
                columnspacing=0.25,
                handletextpad=0,
                markerscale=0.75,
                borderpad=0.25,
                fancybox=True)

plt.gca().add_artist(lm)
plt.figtext(0.02, 0.97, 'a)', fontsize=28)
plt.figtext(0.52, 0.97, 'b)', fontsize=28)
plt.figtext(0.02, 0.525, 'c)', fontsize=28)
plt.figtext(0.52, 0.525, 'd)', fontsize=28)
plt.tight_layout()

for ext in ['eps', 'png']:
    plt.savefig('images/fig5-oxide-effect.{0}'.format(ext), dpi=300)
#+END_SRC

#+RESULTS:
:RESULTS:
:END:




**** Shifts in /d/-band centers
Here is an example of calculating the shifts in the metal /d/-band centers due to strain and ligand effects when the metal lattice constant is used in the periodic direction.

 #+BEGIN_SRC python :results output org drawer
from ase.db import connect
from utils import get_band_properties

db = connect('metal-support-boundary.db')

print '|*Metal*|*$\Delta \epsilon_{d}^{\\textrm{strain}}$ (eV)* | *$\Delta \epsilon_{d}^{\\textrm{ligand}}$ (eV)* | *$\Delta \epsilon_{d}$ (eV)* |'
print '|-'

for metal in ['Rh', 'Ir', 'Pd', 'Pt', 'Ag', 'Au']:
    lattice = metal # can also be 'MgO
    # Unsupported metal
    band_data = db.get(surf='{0}-nanowire'.format(metal),
                       calc_type='relax',
                       ads='None',
                       p_lattice=metal).data['ados']
    
    energy = band_data['energy']
    dos = band_data[5]['d_up'] + band_data[5]['d_down']
    eb0 = get_band_properties(energy, dos, energy_range=(-10, 4))[0]

    # Strained metal, metal lattice in periodic
    band_data = db.get(surf='{0}-nanowire-oxide-removed'.format(metal),
                       calc_type='scf',
                       ads='None',
                       p_lattice=lattice).data['ados']
    
    energy = band_data['energy']
    dos = band_data[5]['d_up'] + band_data[5]['d_down']
    eb_strain = get_band_properties(energy, dos, energy_range=(-10, 4))[0]
    # Could also get the d-band center directly
    eb_strain = band_data[5]['d-band-center']

    # Metal on oxide, metal lattice in periodic
    band_data = db.get(surf='{0}-nanowire-on-MgO'.format(metal),
                       calc_type='relax',
                       ads='None',
                       p_lattice=lattice).data['ados']

    energy = band_data['energy']
    dos = band_data[113]['d_up'] + band_data[113]['d_down']
    eb_supp = get_band_properties(energy, dos, energy_range=(-10, 4))[0]

    strain_shift = eb_strain - eb0
    ligand_shift = eb_supp - eb_strain
    net_shift = eb_supp - eb0

    print '|{metal}| ${strain_shift:1.2f}$| ${ligand_shift:1.2f}$| ${net_shift:1.2f}$|'.format(**locals())
 #+END_SRC

 #+RESULTS:
 :RESULTS:
 | *Metal* | *$\Delta \epsilon_{d}^{\textrm{strain}}$ (eV)* | *$\Delta \epsilon_{d}^{\textrm{ligand}}$ (eV)* | *$\Delta \epsilon_{d}$ (eV)* |
 |---------+------------------------------------------------+------------------------------------------------+------------------------------|
 | Rh      | $0.08$                                         | $-0.25$                                        | $-0.18$                      |
 | Ir      | $0.06$                                         | $-0.28$                                        | $-0.22$                      |
 | Pd      | $0.12$                                         | $-0.35$                                        | $-0.23$                      |
 | Pt      | $0.16$                                         | $-0.49$                                        | $-0.33$                      |
 | Ag      | $0.03$                                         | $-0.15$                                        | $-0.12$                      |
 | Au      | $0.11$                                         | $-0.30$                                        | $-0.19$                      |
 :END:
 



**** Fig.\nbsp{}ref:fig:dbands /d/-band plots

#+BEGIN_SRC python :results output org drawer
from ase.db import connect
from utils import plot_dos
import matplotlib.pyplot as plt
import seaborn as sns

sns.set_context('poster')
sns.set_style('dark')

#plt.figure(figsize=(16,9))
colors = sns.color_palette()[0:3]
db = connect('metal-support-boundary.db')

metal = 'Pt'
lattice = 'MgO'
# Unsupported metal
band_data = db.get(surf='{0}-nanowire'.format(metal),
		   calc_type='relax',
		   ads='None',
		   p_lattice=metal).data['ados']

energy = band_data['energy']
dos = band_data[5]['d_up'] + band_data[5]['d_down']
eb0 = band_data[5]['d-band-center']
plt.subplot(3,1,1)
plot_dos(energy, dos,
         energy_range=(-10, 4),
         c=colors[0],
         xlabel=False,
         keep_x_ticks=False)

plt.xlim(-6, 1)

# Strained metal
band_data = db.get(surf='{0}-nanowire-oxide-removed'.format(metal),
		   calc_type='scf',
		   ads='None',
		   p_lattice=lattice).data['ados']

energy = band_data['energy']
dos = band_data[5]['d_up'] + band_data[5]['d_down']
eb_strain = band_data[5]['d-band-center']
plt.subplot(3,1,2)
plot_dos(energy, dos,
         energy_range=(-10, 4),
         c=colors[1],
         xlabel=False,
         keep_x_ticks=False)

plt.xlim(-6, 1)

# Metal on oxide
band_data = db.get(surf='{0}-nanowire-on-MgO'.format(metal),
		   calc_type='relax',
		   ads='None',
		   p_lattice=lattice).data['ados']

energy = band_data['energy']
dos = band_data[113]['d_up'] + band_data[113]['d_down']
eb_supp = band_data[113]['d-band-center']
plt.subplot(3,1,3)
plot_dos(energy,
         dos,
         energy_range=(-10, 4),
         c=colors[2])

plt.xlim(-6, 1)
plt.tight_layout()
for ext in ['png', 'eps']:
    plt.savefig('images/d-band-shifts.{0}'.format(ext), dpi=200)
plt.show()
#+END_SRC

#+RESULTS:
:RESULTS:
:END:



**** Fig ref:fig:B1-v-R: Adsorption energies at site /B1/ vs site /R/


  #+BEGIN_SRC python :results output org drawer
fromAgg ase.db import connect
from utils import get_energy, amarkers, mcolors
import matplotlib.pyplot as plt
import seaborn as sns

sns.set_context('poster')
plt.figure(figsize=(9,6), dpi=200)
db = connect('metal-support-boundary.db')

metals = ['Rh', 'Ir', 'Pd', 'Pt', 'Ag', 'Au']
adsorbates = ['C', 'CH', 'CH2', 'N', 'HN', 'H2N', 'O', 'HO', 'F']
alabels = ['C', 'CH', 'CH$_{2}$', 'N', 'NH', 'NH$_{2}$', 'O', 'OH', 'F']

for i, ads in enumerate(adsorbates):

    specie_e = get_energy(db, specie=ads)

    for metal in metals:


        E_M_MgO_A = get_energy(db,
                               surf='{0}-nanowire-on-MgO'.format(metal),
                               ads=ads,
                               calc_type='relax',
			       site='B1',
                               p_lattice='MgO')


        E_remote_A = get_energy(db,
                                surf='{0}-nanowire-on-MgO'.format(metal),
                                site='R',
                                ads=ads,
                                p_lattice='MgO',
                                calc_type='relax')

        E_clean_nw = get_energy(db,
                                surf='{0}-nanowire-on-MgO'.format(metal),
                                ads='None',
                                p_lattice='MgO',
                                calc_type='relax')                             

        E_ads_R = E_remote_A - E_clean_nw - specie_e
        E_ads_B1 = E_M_MgO_A - E_clean_nw - specie_e
        
        kwargs = {'c':mcolors[metal],
                  'marker': 's',
                  'ms':22,
                  'mec':'k',
                  'mew':1.5}

	plt.plot(i, E_ads_B1 - E_ads_R, **kwargs)

	if i is 0:
            plt.plot([], [], label=metal, ls='', **kwargs)

plt.xticks(range(len(adsorbates)), alabels, fontsize=24)
plt.yticks(fontsize=20)

plt.xlim([-0.5, len(adsorbates) - 0.5])
plt.ylabel('$E_{\mathrm{ads}_{B1}} - E_{\mathrm{ads}_{R}}$ (eV)', fontsize=28)

plt.legend(ncol=3,
           frameon=True,
           fancybox=True,
           markerscale=0.7,
	   borderpad=0.5,
           handletextpad=0,
	   columnspacing=0.25,
	   fontsize=24,
           loc=4)


plt.tight_layout()
for ext in ['eps', 'png']:
    plt.savefig('images/B1-v-R.{0}'.format(ext), dpi=200)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:




bibliography:~/Dropbox/bibliography/references.bib

